import MainLayout from "../main.layout";

export default function Analyze() {
    return (
        <MainLayout>
            <div className="container mx-auto p-4">
                <h1 className="text-3xl font-bold mb-4">การเก็บตัวอย่างดินเพื่อวิเคราะห์ทางเคมี</h1>

                <section className="mb-8">
                    <h2 className="text-2xl font-semibold mt-4">หลักสำคัญ</h2>
                    <ol className="list-decimal list-inside ml-4 mt-2 space-y-2">
                        <li>ตัวอย่างดินที่เก็บจะต้องเป็นตัวแทนที่ถูกต้องของที่ดินในบริเวณนั้น ถ้าเก็บมาผิดพลาดผลการวิเคราะห์ และการแนะนำการใช้ปุ๋ยหรือการจัดการดินจะผิดพลาดทั้งหมด</li>
                        <li>อุปกรณ์และภาชนะต่างๆ ที่ใช้ในการเก็บดินต้องสะอาด</li>
                        <li>ตัวอย่างดินแต่ละตัวอย่างจะต้องเป็นตัวแทนที่ดีของพื้นที่ ที่มีความสม่ำเสมอกันและมีพื้นที่ไม่เกิน 25 ไร่ ถ้าพื้นที่ใหญ่มากหรือไม่สม่ำเสมอ เช่น มีความลาดเทต่างกัน ปลูกพืชต่างชนิดกัน หรือเคยใช้ปุ๋ยต่างกัน ฯลฯ พื้นที่เช่นนี้จะต้องแบ่งออกเป็นแปลงย่อยแล้วเก็บตัวอย่างดินแปลงย่อยละหนึ่งตัวอย่าง</li>
                        <li>เวลาที่เก็บตัวอย่างดินจะเก็บเมื่อใดก็ได้ แต่สำหรับกรณีที่เป็นพื้นที่ไร่นา หรือพื้นที่ยังไม่มีการปลูกพืช การปลูกพืชตามฤดูกาล แนะนำให้เก็บดินก่อนปลูกพืชให้เดินสุ่มเก็บตัวอย่างดินให้ทั่วแปลงในแต่ละแปลง แปลง 2 เดือน</li>
                        <li>พื้นที่ดินแต่ละแปลง ควรเก็บตัวอย่างมาวิเคราะห์ 2-3 ปีต่อครั้ง</li>
                        <li>เพื่อให้การแนะนำถูกต้องที่สุด เกษตรกรจะต้องกรอกข้อมูลต่าง ๆ เกี่ยวกับการใช้ที่ดินที่ผ่านมาแล้วให้มากและละเอียดที่สุด</li>
                    </ol>
                </section>

                <section className="mb-8">
                    <h2 className="text-2xl font-semibold mt-4">อุปกรณ์และวิธีการในการเก็บดิน</h2>
        
                    <div className="mt-4">
                        <div className="grid grid-cols-1 md:grid-cols-3 gap-4 md:gap-6 xl:gap-8">
                            <div>
                                <img src={'/image/a1.jpg'} className="w-full max-w-2xl my-4" alt="อุปกรณ์ที่ใช้ในการเก็บดิน" />
                                <span className="text-xl">อุปกรณ์ที่ใช้</span>
                            </div>
                            <div>
                                <img src={'/image/a4.jpg'} className="w-full max-w-2xl my-4" alt="การแบ่งพื้นที่" />
                                <span className="text-xl">1.แบ่งพื้นที่ เมื่อแบ่งแล้วให้หมายเลขแต่ละแปลงหรือทำแผนที่แสดงการแบ่งแปลงเพื่อกันลืม</span>
                            </div>
                            <div>
                                <img src={'/image/a3.jpg'} className="w-full max-w-2xl my-4" alt="การสุ่มตัวอย่างดิน" />
                                <span className="text-xl">2.กรณีเป็นพื้นที่ไร่นา หรือพื้นที่ที่ยังไม่มีการปลูกพืชให้เดินสุ่มตัวอย่างดินให้ทั่วแปลงในแต่ละแปลง แปลงละประมาณ 15 จุด</span>
                            </div>
                            <div>
                                <img src={'/image/a5.jpg'} className="w-full max-w-2xl my-4" alt="การเก็บดิน" />
                                <span className="text-xl">3.การเก็บดินแต่ละจุดให้ใช้พลั่วขุดดินเป็นรูปลิ่มลึกประมาณ 15 ซม. หลังจากนั้นเก็บดิน โดยใช้พลั่วแซะดินข้างหลุม (ด้านเรียบ) ให้ได้ดินเป็นแผ่นหนาประมาณ 2-3 ซม. จนถึงก้นหลุม ดินที่ได้เก็บรวบรวมใส่ถุง หรือถังพลาสติก</span>

                            </div>
                            <div>
                                <img src={'/image/a2.jpg'} className="w-full max-w-2xl my-4" alt="การคลุกเคล้าดิน" />
                                <span className="text-xl">4.คลุกเคล้าดินแต่ละแปลงที่เก็บมาให้เข้ากันแล้วเทลงบนผ้าพลาสติก ทำการคลุกเคล้าอีกครั้งโดยยกมุมผ้าพลาสติก ทีละ 2 มุม ที่อยู่ตรงข้ามกัน ทำสลับมุมกัน 3-4 ครั้ง</span>
                            </div>
                            <div>
                                <img src={'/image/a6.jpg'} className="w-full max-w-2xl my-4" alt="การกองดิน" />
                                <span className="text-xl">5.หลังจากนั้นกองดินให้เป็นรูปฝาชี แล้วใช้มือตบยอดกองให้แบนราบ หลังจากนั้นใช้นิ้วมือขีดเป็นกากบาทบนยอดกอง ซึ่งจะทำให้ดินถูกแบ่งแยกเป็น 4 ส่วน เก็บตัวอย่างจากกองดินนี้เพียง 1 ส่วน ให้ได้ดินหนักประมาณ 1-2 กิโลกรัม ใส่ดินลงในถุงพลาสติกที่เตรียมไว้เพื่อส่งวิเคราะห์</span>
                            </div>
                        </div>
                    </div>
                </section>
            </div>
        </MainLayout>
    );
}
